---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BasepointLongitudeParam
source: html/65b68477-8c6c-ad75-32ff-1193e2bef945.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BasepointLongitudeParam Property

"Lon"

## Syntax (C#)
```csharp
public static ForgeTypeId BasepointLongitudeParam { get; }
```